using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;
using System.Windows.Forms;
using библиотекаћетодов–оботаЌа—труктуреѕоле;
using библиотека‘ормировани€—ред;
 


namespace WinFormsApp1
{
    static class Program
    {
         
        static ситуаци€Ќаѕоле поле;
        static инфо–обот робот;
        static построитель—реды построитель = new построитель—реды();

        [STAThread]
        static void Main()
        { 

            Application.EnableVisualStyles();
            Application.SetCompatibleTextRenderingDefault(false);
            поле = построитель.построитель—реды–обота("if", 10);
          
            Application.Run(new среда–обота(поле));
            робот = new инфо–обот(поле);

              
            –ешение«адачи3();
            поле = робот.результат–аботы;
            Application.Run(new среда–обота(поле));

        }
        static void –ешение«адачи3()
        {
            int y = 0;
            int x = 0;
            while (робот.снизу—вободно)
            {
                робот.вниз();
            }
            
            while(робот.справа—вободно)
            {
                робот.вправо();
            }

            while(робот.сверху—вободно)
            {
                робот.вверх();
                y++;
            }

            while(робот.слева—вободно)
            {
                робот.влево();
                x++;
            }

            for(int i = 0; i <= y; i++)
            {
                for(int k = 0; k <= x; k++)
                {

                    if (i % 2 == 0 && робот.справа—вободно)
                    {
                        if (робот.температура > 0)
                        {
                            func();
                        }
                        робот.вправо();

                    }
                    else if (i % 2 == 1 && робот.слева—вободно)
                    {

                        if (робот.температура > 0)
                        {
                            func();
                        }
                        робот.влево();


                    }
                }
                if (робот.температура > 0)
                {
                    func();
                }
                if (робот.снизу—вободно)
                {
                робот.вниз();
                }

            }

            робот.конечна€“очка–обота();

            void func()
            {
                if (робот.снизу—вободно)
                {
                    робот.вниз();
                    if(робот.клетка«акрашена)
                    {

                    } else
                    {
                        if (робот.температура == 0)
                        {
                            робот.закрасить();
                        }
                    }
 
                    робот.вверх();
                }
                if (робот.сверху—вободно)
                {
                    робот.вверх();
                    if (робот.клетка«акрашена)
                    {

                    }
                    else
                    {
                        if (робот.температура == 0)
                        {
                            робот.закрасить();
                        }
                    }
                    робот.вниз();
                }
                if (робот.слева—вободно)
                {
                    робот.влево();
                    if (робот.клетка«акрашена)
                    {
                        
                    }
                    else
                    {
                        if (робот.температура == 0)
                        {
                            робот.закрасить();
                        }
                    }
                    робот.вправо();
                }
                  if (робот.справа—вободно)
         
                    
                    {
                        робот.вправо();
                        if (робот.клетка«акрашена)
                        {

                        }
                        else
                        {
                        if (робот.температура == 0)
                        {
                            робот.закрасить();
                        }
                    }
                        робот.влево();
                    }
                
                
            }
        }

    }

  
    }

