using System;

namespace построениеКлассаВектор_задача01
{
    /*      
     *  Построить класс вектор элементов со значениями элементов, указанного в условии задачи типа.
     *  Предусмотреть инициализацию вектора (конструкторы)
     *    -	значениями по умолчанию;
     *    -	значениеми, передаваемыми входным параметром;
     *    -	значениями, указанными соответствующим вариантом задания (из файла Inlet.in с учетом 
     *    указанных в условии задачи особенностями).
     *    
     *  В данном классе предусмотреть реализацию методов, указанных в условии задачи связанных с
     *    -	выделением элементов объекта класса в новый объект;
     *    -	поиском особенностей элементов объекта;
     *    -	расчетом указанных в условии характеристик элементов объекта;
     *    -	преобразованием элементов объекта класса.
     *  Построить индексатор класса и несколько, необходимых свойств.
     *  
     *     Задача № 01 Дан линейный массив, содержащий целочисленные значения.
     *     Выделить те элементы этого массива в массив В, индексы которых являются степенями числа С.
     *     
     *       Ввод (файл Inlet.in):
     *         С
     *         Элементы массива А по одному в строке
     *       
     *       Вывод (на консоль):
     *         Результаты всех этапов работы.
     *         
     *    -	Под поиском особенностей элементов объекта будем понимать расчет максимально допустимой степени числа С;
     *    -	Под расчетом указанных в условии характеристик элементов объекта будем понимать построение массива 
     *    степеней числа С - индексов извлекаемых из исходного объекта значений;
     *    -	Под выделением элементов объекта класса в новый объект будем понимать построение объекта В;
     *    -	Под преобразованием элементов объекта класса будем понимать увеличение компонент исходного объекта в С раз.
     */
    class Program
    {
        static void Main(string[] args)
        {
            try
            {
                Вектор р = new Вектор(5, -9, -987);
                р.выводИнформации();

                ФормировательФайлаДанныхЗадачи01 формирователь = new ФормировательФайлаДанныхЗадачи01(4);
                Вектор а = new Вектор("Inlet.in");
                а.выводИнформации();
                Console.WriteLine("\n Мощность объекта = {0}", а.мощностьОбъекта);
                Console.WriteLine("Верхняя граница степеней С = {0}", а.верхняяГраницаСтепенейС);
                Console.WriteLine("Мощность объекта = {0}", а.мощностьОбъекта);
                int[] ind = а.массивИндексовКопируемыхЭлементов();
                Вектор b = а.построениеВектора(ind);
                Console.WriteLine("Мощность объекта В = {0}\n", b.мощностьОбъекта);
                Console.WriteLine("\n Результирующий вектор В ");
                b.выводИнформации();
                а.преобразованиеОбъекта();
                а.выводИнформации();
            }
            catch (Exception сообщение)
            {
                Console.WriteLine(сообщение);
            }
            
        }
    }
}
